## Plan Result (prod-prod)




<pre><code>Plan: 166 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;api&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;api.dev&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;api.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;api.prp&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;api.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;apigw&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;apigw.dev&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;apigw.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;apigw.prp&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;apigw.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;identity-gateway&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;identity-gateway.bae&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;identity-gateway.prp2&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;identity-gateway.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;identity-gateway.support&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;identity-gateway.test&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;libra-gateway.cpp&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;login&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;login.bae&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;login.prp2&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;login.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;login.support&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;login.test&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;manage-users&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;manage-users.bae&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;manage-users.prp2&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;manage-users.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;manage-users.support&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;manage-users.test&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;my-services&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;my-services.bae&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;my-services.prp2&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;my-services.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;my-services.support&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;my-services.test&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;nft.cpp&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;nft02.cpp&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;onlineplea&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;onlineplea.dev&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;onlineplea.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;onlineplea.prp&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;onlineplea.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;prosecuting&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;prosecuting-stub-idam.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;prosecuting-stub-idam.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;prosecuting-stub-idam.support&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;prosecuting-stub-idam.test&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;prosecuting.bae&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;prosecuting.dev&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;prosecuting.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;prosecuting.prp&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;prosecuting.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;rota&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;rota-nft.nftpr2&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;rota-stub-idam.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;rota-stub-idam.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;rota-stub-idam.support&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;rota-stub-idam.test&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;rota.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;rota.prp&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;rota.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;token&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;token.bae&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;token.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;token.nft.cpp&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;token.prp&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;token.prp2&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;token.sit&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;token.support&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;token.test&#34;]
  * module.cjscp_org_uk.azurerm_dns_a_record.this[&#34;tools-nle.nft.cpp&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;demo&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;em5650&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;em7121&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;email&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;ftp&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;identity-gateway.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;identity-gateway.nft.cpp&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;identity-gateway.nftpr2&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;identity-gateway.prp&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;login.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;login.nft.cpp&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;login.nftpr2&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;login.prp&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;manage-users.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;manage-users.nft.cpp&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;manage-users.nftpr2&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;manage-users.prp&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;my-services.nft&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;my-services.nft.cpp&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;my-services.nftpr2&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;my-services.prp&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;s1._domainkey&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;s2._domainkey&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;token.nftpr2&#34;]
  * module.cjscp_org_uk.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.cjscp_org_uk.azurerm_dns_mx_record.this[&#34;@&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;atcmdemo&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;c2idemo&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;c2ishowandtell&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;ccr-prototype&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;ccrdemo&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;confluence-nle&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;cp.cjs&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;crowd-nle&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;dev.cpp&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;devcp2.cpp&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;i2tdemo&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;jira-nle&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;pp.confluence&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;pp.crowd&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;pp.hipchat&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;pp.jira&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;preprod-bastion&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;prod-bastion&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;r2showandtell&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;redact.c2idemo&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;redact.dev.cpp&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;sandbox.divorce-backoffice.reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;sandbox.divorce.reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;sandbox.probate-two.reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;sandbox.probate.reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;sandbox.sscs.reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;test-reform&#34;]
  * module.hmcts_net.azurerm_dns_a_record.this[&#34;tools&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;*.dev.cpp&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;*.dev2.cpp&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;_domainconnect&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;autodiscover&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;email&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;enterpriseenrollment&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;enterpriseregistration&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;ftp&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;lyncdiscover&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;msoid&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;notices&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;selector1._domainkey&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;selector2._domainkey&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;sip&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;tools.oldprd&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.hmcts_net.azurerm_dns_cname_record.this[&#34;www.notices&#34;]
  * module.hmcts_net.azurerm_dns_mx_record.this[&#34;@&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;apps&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;apps-nle&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;az&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;ctsc&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;hearings&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;internal&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;lab&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;mft&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;platform&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;reform&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;sftp&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;ukc&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;vh&#34;]
  * module.hmcts_net.azurerm_dns_srv_record.this[&#34;_sip._tls&#34;]
  * module.hmcts_net.azurerm_dns_srv_record.this[&#34;_sipfederationtls._tcp&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;@&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;_asvdns-c088fba7-73a7-472a-badb-d3009e6de955&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;_dmarc&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;_github-challenge-hmcts&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;cp.cjs&#34;]
  * module.hmcts_net.azurerm_dns_txt_record.this[&#34;mailrelay.platform&#34;]
  * module.hmcts_net.azurerm_dns_zone.zone
  * module.hmcts_net.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cjscp_org_uk.azurerm_dns_a_record.this["api"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "api"
      + records             = [
          + "52.151.86.126",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["api.dev"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "api.dev"
      + records             = [
          + "51.140.122.1",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["api.nft"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "api.nft"
      + records             = [
          + "52.151.88.205",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["api.prp"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "api.prp"
      + records             = [
          + "52.151.86.221",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["api.sit"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "api.sit"
      + records             = [
          + "52.151.80.183",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["apigw"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "apigw"
      + records             = [
          + "52.151.86.126",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["apigw.dev"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "apigw.dev"
      + records             = [
          + "51.140.122.1",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["apigw.nft"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "apigw.nft"
      + records             = [
          + "52.151.88.205",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["apigw.prp"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "apigw.prp"
      + records             = [
          + "52.151.86.221",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["apigw.sit"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "apigw.sit"
      + records             = [
          + "52.151.80.183",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["identity-gateway"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "identity-gateway"
      + records             = [
          + "13.79.32.203",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["identity-gateway.bae"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "identity-gateway.bae"
      + records             = [
          + "51.140.115.34",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["identity-gateway.prp2"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "identity-gateway.prp2"
      + records             = [
          + "13.87.71.105",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["identity-gateway.sit"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "identity-gateway.sit"
      + records             = [
          + "40.120.50.225",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["identity-gateway.support"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "identity-gateway.support"
      + records             = [
          + "51.145.9.218",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["identity-gateway.test"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "identity-gateway.test"
      + records             = [
          + "51.140.120.225",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["libra-gateway.cpp"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "libra-gateway.cpp"
      + records             = [
          + "51.179.202.173",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["login"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "login"
      + records             = [
          + "13.79.32.203",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["login.bae"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "login.bae"
      + records             = [
          + "51.140.115.34",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["login.prp2"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "login.prp2"
      + records             = [
          + "13.87.71.105",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["login.sit"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "login.sit"
      + records             = [
          + "40.120.50.225",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["login.support"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "login.support"
      + records             = [
          + "51.145.9.218",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["login.test"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "login.test"
      + records             = [
          + "51.140.120.225",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["manage-users"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-users"
      + records             = [
          + "13.79.32.203",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["manage-users.bae"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-users.bae"
      + records             = [
          + "51.140.115.34",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["manage-users.prp2"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-users.prp2"
      + records             = [
          + "13.87.71.105",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["manage-users.sit"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-users.sit"
      + records             = [
          + "40.120.50.225",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["manage-users.support"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-users.support"
      + records             = [
          + "51.145.9.218",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["manage-users.test"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-users.test"
      + records             = [
          + "51.140.120.225",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["my-services"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "my-services"
      + records             = [
          + "13.79.32.203",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["my-services.bae"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "my-services.bae"
      + records             = [
          + "51.140.115.34",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["my-services.prp2"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "my-services.prp2"
      + records             = [
          + "13.87.71.105",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["my-services.sit"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "my-services.sit"
      + records             = [
          + "40.120.50.225",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["my-services.support"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "my-services.support"
      + records             = [
          + "51.145.9.218",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["my-services.test"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "my-services.test"
      + records             = [
          + "51.140.120.225",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["nft.cpp"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nft.cpp"
      + records             = [
          + "51.140.118.70",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["nft02.cpp"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nft02.cpp"
      + records             = [
          + "51.140.118.70",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["onlineplea"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "onlineplea"
      + records             = [
          + "51.140.120.175",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["onlineplea.dev"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "onlineplea.dev"
      + records             = [
          + "51.140.39.30",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["onlineplea.nft"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "onlineplea.nft"
      + records             = [
          + "51.140.118.70",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["onlineplea.prp"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "onlineplea.prp"
      + records             = [
          + "51.140.189.195",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.org.uk"
    }

  # module.cjscp_org_uk.azurerm_dns_a_record.this["onlineplea.sit"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "onlineplea.sit"
      + records             = [
          + "51.140.120.225",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "cjscp.o

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

erpriseenrollment"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "enterpriseenrollment"
      + record              = "enterpriseenrollment.manage.microsoft.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["enterpriseregistration"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "enterpriseregistration"
      + record              = "enterpriseregistration.windows.net."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["ftp"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ftp"
      + record              = "@"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["lyncdiscover"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "lyncdiscover"
      + record              = "webdir.online.lync.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["msoid"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "msoid"
      + record              = "clientconfig.microsoftonline-p.net."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["notices"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "notices"
      + record              = "www95.wixdns.net."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["selector1._domainkey"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "selector1._domainkey"
      + record              = "selector1-hmcts-net._domainkey.cjscommonplatform.onmicrosoft.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["selector2._domainkey"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "selector2._domainkey"
      + record              = "selector2-hmcts-net._domainkey.cjscommonplatform.onmicrosoft.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["sip"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sip"
      + record              = "sipdir.online.lync.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["tools.oldprd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "tools.oldprd"
      + record              = "atlprod.northeurope.cloudapp.azure.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "@"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_cname_record.this["www.notices"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.notices"
      + record              = "www95.wixdns.net."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_mx_record.this["@"] will be created
  + resource "azurerm_dns_mx_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + exchange   = "hmcts-net.mail.protection.outlook.com."
          + preference = "0"
        }
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["apps"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "apps"
      + records             = [
          + "ns1-03.azure-dns.com.",
          + "ns2-03.azure-dns.net.",
          + "ns3-03.azure-dns.org.",
          + "ns4-03.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["apps-nle"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "apps-nle"
      + records             = [
          + "ns1-01.azure-dns.com.",
          + "ns2-01.azure-dns.net.",
          + "ns3-01.azure-dns.org.",
          + "ns4-01.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["az"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "az"
      + records             = [
          + "ns2.he.net.",
          + "ns3.he.net.",
          + "ns4.he.net.",
          + "ns5.he.net.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["ctsc"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ctsc"
      + records             = [
          + "ns1-09.azure-dns.com.",
          + "ns2-09.azure-dns.net.",
          + "ns3-09.azure-dns.org.",
          + "ns4-09.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["hearings"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hearings"
      + records             = [
          + "ns1-07.azure-dns.com.",
          + "ns2-07.azure-dns.net.",
          + "ns3-07.azure-dns.org.",
          + "ns4-07.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["internal"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "internal"
      + records             = [
          + "ns1-02.azure-dns.com",
          + "ns2-02.azure-dns.net",
          + "ns3-02.azure-dns.org",
          + "ns4-02.azure-dns.info",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 900
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["lab"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "lab"
      + records             = [
          + "ns1-02.azure-dns.com.",
          + "ns2-02.azure-dns.net.",
          + "ns3-02.azure-dns.org.",
          + "ns4-02.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["mft"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mft"
      + records             = [
          + "ns1-01.azure-dns.com.",
          + "ns2-01.azure-dns.net.",
          + "ns3-01.azure-dns.org.",
          + "ns4-01.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["platform"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "platform"
      + records             = [
          + "ns1-04.azure-dns.com.",
          + "ns2-04.azure-dns.net.",
          + "ns3-04.azure-dns.org.",
          + "ns4-04.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 1800
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["reform"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reform"
      + records             = [
          + "ns1-09.azure-dns.com.",
          + "ns2-09.azure-dns.net.",
          + "ns3-09.azure-dns.org.",
          + "ns4-09.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["sftp"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sftp"
      + records             = [
          + "ns1-03.azure-dns.com.",
          + "ns2-03.azure-dns.net.",
          + "ns3-03.azure-dns.org.",
          + "ns4-03.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["ukc"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ukc"
      + records             = [
          + "ns2.he.net.",
          + "ns3.he.net.",
          + "ns4.he.net.",
          + "ns5.he.net.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["vh"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh"
      + records             = [
          + "ns1-01.azure-dns.com.",
          + "ns2-01.azure-dns.net.",
          + "ns3-01.azure-dns.org.",
          + "ns4-01.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_srv_record.this["_sip._tls"] will be created
  + resource "azurerm_dns_srv_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_sip._tls"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + port     = 443
          + priority = 100
          + target   = "sipdir.online.lync.com."
          + weight   = 1
        }
    }

  # module.hmcts_net.azurerm_dns_srv_record.this["_sipfederationtls._tcp"] will be created
  + resource "azurerm_dns_srv_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_sipfederationtls._tcp"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + port     = 5061
          + priority = 100
          + target   = "sipfed.online.lync.com."
          + weight   = 1
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["@"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 86400
      + zone_name           = "hmcts.net"

      + record {
          + value = "Dynatrace-site-verification=d47aef0a-5479-4cca-a55c-61e11aa2dfd2__h43u3tim5arpipfnpqj3l75aap"
        }
      + record {
          + value = "docker-verification=f8449b84-5631-4671-b7f0-e7f06acbdbf8"
        }
      + record {
          + value = "google-site-verification=4lnbRW6qCFRgeNOyGIONf-Z2xyieSnKiHMngA60wxpE"
        }
      + record {
          + value = "google-site-verification=TMU69wadrpW6V0YxpFfxuXST3nKEiMWWHA2KN88CwvI"
        }
      + record {
          + value = "v=spf1 include:spf.protection.outlook.com include:notifications.service.gov.uk include:mailrelay.platform.hmcts.net include:prod.mailrelay.platform.hmcts.net a:c.spf.service-now.com -all"
        }
      + record {
          + value = "v=verifydomain MS=6154796"
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["_asvdns-c088fba7-73a7-472a-badb-d3009e6de955"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_asvdns-c088fba7-73a7-472a-badb-d3009e6de955"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + value = "asvdns_34e5993c-ddc8-4eba-9d00-b9f6f77b97f2"
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["_dmarc"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dmarc"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + value = "v=DMARC1;p=reject;sp=reject;fo=1;rua=mailto:ems@hmcts.net,mailto:ZMrwN3whEje@dmarc-rua.mailcheck.service.ncsc.gov.uk;ruf=mailto:ems@hmcts.net"
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["_github-challenge-hmcts"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_github-challenge-hmcts"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + value = "2902f9735b"
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["cp.cjs"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cp.cjs"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + value = "MS=ms61478066"
        }
    }

  # module.hmcts_net.azurerm_dns_txt_record.this["mailrelay.platform"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mailrelay.platform"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"

      + record {
          + value = "MS=ms79803021"
        }
    }

  # module.hmcts_net.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.hmcts_net.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 166 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1143,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->